tests/soak/results/20251231_233317/load_results.txt

Summary:
  Total:	3600.0026 secs
  Slowest:	7.8836 secs
  Fastest:	0.0002 secs
  Average:	0.0139 secs
  Requests/sec:	775.1892
  
  Total data:	86362549 bytes
  Size/request:	86 bytes

Response time histogram:
  0.000 [1]	|
  0.789 [999694]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  1.577 [0]	|
  2.365 [0]	|
  3.154 [0]	|
  3.942 [0]	|
  4.730 [0]	|
  5.519 [0]	|
  6.307 [0]	|
  7.095 [0]	|
  7.884 [305]	|


Latency distribution:
  10% in 0.0005 secs
  25% in 0.0008 secs
  50% in 0.0011 secs
  75% in 0.0020 secs
  90% in 0.0317 secs
  95% in 0.0323 secs
  99% in 0.0615 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0002 secs, 7.8836 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0019 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0040 secs
  resp wait:	0.0112 secs, 0.0002 secs, 0.3471 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0151 secs

Status code distribution:
  [200]	1000000 responses

Error distribution:
  [43]	Get "http://localhost:8080/api": EOF
  [82]	Get "http://localhost:8080/api": dial tcp [::1]:8080: connect: connection refused
  [1]	Get "http://localhost:8080/api": read tcp [::1]:49351->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:49370->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:49371->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:49372->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:49373->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:49374->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:49384->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:49385->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:49386->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:49387->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:49388->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:49398->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:49405->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:49406->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:49407->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:49408->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:49409->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:49418->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:49419->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:49420->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:49421->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:49422->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:49430->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:49431->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:49432->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:49433->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:49434->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:49445->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:49446->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:49447->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:49448->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:49449->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:49460->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:49461->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:49462->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:49463->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:49464->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:49477->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:49478->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:49479->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:49480->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:49481->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:49490->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:49491->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:49492->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:49493->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:49494->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:49506->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:49507->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:49508->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:49509->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:49510->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:49521->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:49522->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:49523->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:49524->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:49525->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:49538->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:49539->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:49540->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:49541->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:49542->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:49553->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:49554->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:49555->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:49556->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:49557->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:49565->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:49566->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:49567->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:49568->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:49569->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:49580->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:49581->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:49582->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:49583->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:49584->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:49592->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:49593->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:49594->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:49595->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:49596->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:49612->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:49613->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:49614->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:49615->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:49616->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53572->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53575->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53576->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53577->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53578->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53579->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53580->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53581->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53582->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53583->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53584->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53585->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53586->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53587->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53588->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53589->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53590->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53591->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53592->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53593->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53594->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53595->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53596->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53597->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53598->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53599->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53600->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53601->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53602->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53603->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53604->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53605->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53606->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53607->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53609->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53610->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53611->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53612->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53613->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53614->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53615->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53616->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53617->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53618->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53619->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53620->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53621->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53622->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53623->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53624->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53625->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53626->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53627->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53628->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53629->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53630->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53631->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53632->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53633->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53634->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53635->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53636->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53637->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53638->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53639->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53640->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53641->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53642->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53643->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53644->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53645->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53646->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53647->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53648->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53649->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53650->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53651->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53652->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53653->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53654->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53655->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53656->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53657->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53658->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53659->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53660->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53661->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53662->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53663->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53664->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53665->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53666->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53667->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53668->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53669->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53670->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53671->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53672->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53673->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53674->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53675->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53676->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53677->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53678->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53679->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53680->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53681->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53682->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53683->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53684->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53685->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53686->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53687->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53688->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53689->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53690->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53691->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53692->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53693->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53694->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53695->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53696->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53697->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53698->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53699->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53700->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53701->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53702->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53703->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53704->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53705->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53706->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53707->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53708->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53709->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53710->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53711->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53712->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53713->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53714->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53715->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53716->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53717->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53718->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53719->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53720->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53721->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53722->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53723->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53724->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53725->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53726->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53727->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53728->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53729->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53730->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53731->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53732->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53733->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53734->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53735->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53736->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53737->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53738->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53739->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53740->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53741->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53742->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53743->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53744->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53745->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53746->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53747->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53748->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53749->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53750->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53751->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53752->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53753->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53754->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53755->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53756->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53757->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53758->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53759->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53760->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53761->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53762->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53763->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53764->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53765->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53766->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:53767->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:57981->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:57982->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:57984->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:57993->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:57994->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:57995->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:57996->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:57997->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:57998->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:57999->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58000->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58001->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58002->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58011->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58012->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58013->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58014->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58015->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58016->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58017->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58018->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58019->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58020->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58021->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58022->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58023->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58024->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58025->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58026->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58027->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58028->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58029->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58030->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58031->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58032->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58033->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58034->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58035->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58036->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58037->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58038->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58039->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58040->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58041->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58042->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58043->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58044->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58045->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58046->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58047->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58048->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58049->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58050->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58051->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58052->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58053->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58054->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58055->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58056->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58057->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58058->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58059->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58060->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58061->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58062->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58063->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58064->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58065->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58066->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58067->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58068->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58069->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58070->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58071->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58072->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58077->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58078->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58079->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58082->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58083->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58084->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58085->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58086->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58087->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58088->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58089->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58090->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58091->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58092->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58093->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58094->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58095->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58096->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58097->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58098->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58099->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58100->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58101->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58102->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58103->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58104->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58105->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58106->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58107->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58108->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58109->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58110->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58111->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58112->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58113->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58114->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58115->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58116->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58117->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58118->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58119->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58120->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58121->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58122->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58123->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58124->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58125->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58126->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58127->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58128->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58129->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58130->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58131->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58132->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58133->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58134->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58135->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58136->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58137->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58138->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58139->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58140->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58141->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/api": read tcp [::1]:58142->[::1]:8080: read: connection reset by peer